{"modelTopology": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "InputLayer_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false, "name": "InputLayer_0"}, "inbound_nodes": []}, {"name": "Permute_0", "class_name": "Permute", "config": {"dims": [3, 1, 2], "name": "Permute_0", "trainable": true}, "inbound_nodes": [[["InputLayer_0", 0, 0, {}]]]}, {"name": "Permute_1", "class_name": "Permute", "config": {"dims": [2, 3, 1], "name": "Permute_1", "trainable": true}, "inbound_nodes": [[["Permute_0", 0, 0, {}]]]}, {"name": "Conv2D_0", "class_name": "Conv2D", "config": {"filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_0", "trainable": true}, "inbound_nodes": [[["Permute_1", 0, 0, {}]]]}, {"name": "GlobalAveragePooling2D_0", "class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "name": "GlobalAveragePooling2D_0", "trainable": true}, "inbound_nodes": [[["Conv2D_0", 0, 0, {}]]]}, {"name": "Dense_0", "class_name": "Dense", "config": {"units": 6, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "Dense_0", "trainable": true}, "inbound_nodes": [[["GlobalAveragePooling2D_0", 0, 0, {}]]]}], "input_layers": [["InputLayer_0", 0, 0]], "output_layers": [["Dense_0", 0, 0]]}, "keras_version": "tfjs-layers 1.1.0", "backend": "tensor_flow.js"}}