{"modelTopology": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "InputLayer_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false, "name": "InputLayer_2"}, "inbound_nodes": []}, {"name": "Conv2D_0", "class_name": "Conv2D", "config": {"filters": 66, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_0", "trainable": true}, "inbound_nodes": [[["InputLayer_2", 0, 0, {}]]]}, {"name": "Conv2D_1", "class_name": "Conv2D", "config": {"filters": 66, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_1", "trainable": true}, "inbound_nodes": [[["Conv2D_0", 0, 0, {}]]]}, {"name": "AveragePooling2D_0", "class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "AveragePooling2D_0", "trainable": true}, "inbound_nodes": [[["Conv2D_1", 0, 0, {}]]]}, {"name": "Conv2D_2", "class_name": "Conv2D", "config": {"filters": 129, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_2", "trainable": true}, "inbound_nodes": [[["AveragePooling2D_0", 0, 0, {}]]]}, {"name": "Conv2D_3", "class_name": "Conv2D", "config": {"filters": 129, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_3", "trainable": true}, "inbound_nodes": [[["Conv2D_2", 0, 0, {}]]]}, {"name": "AveragePooling2D_1", "class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "AveragePooling2D_1", "trainable": true}, "inbound_nodes": [[["Conv2D_3", 0, 0, {}]]]}, {"name": "Conv2D_4", "class_name": "Conv2D", "config": {"filters": 333, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_4", "trainable": true}, "inbound_nodes": [[["AveragePooling2D_1", 0, 0, {}]]]}, {"name": "Conv2D_5", "class_name": "Conv2D", "config": {"filters": 333, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_5", "trainable": true}, "inbound_nodes": [[["Conv2D_4", 0, 0, {}]]]}, {"name": "Conv2D_6", "class_name": "Conv2D", "config": {"filters": 333, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_6", "trainable": true}, "inbound_nodes": [[["Conv2D_5", 0, 0, {}]]]}, {"name": "AveragePooling2D_2", "class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "AveragePooling2D_2", "trainable": true}, "inbound_nodes": [[["Conv2D_6", 0, 0, {}]]]}, {"name": "Conv2D_7", "class_name": "Conv2D", "config": {"filters": 513, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_7", "trainable": true}, "inbound_nodes": [[["AveragePooling2D_2", 0, 0, {}]]]}, {"name": "Conv2D_8", "class_name": "Conv2D", "config": {"filters": 513, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_8", "trainable": true}, "inbound_nodes": [[["Conv2D_7", 0, 0, {}]]]}, {"name": "Conv2D_9", "class_name": "Conv2D", "config": {"filters": 513, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_9", "trainable": true}, "inbound_nodes": [[["Conv2D_8", 0, 0, {}]]]}, {"name": "AveragePooling2D_3", "class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "AveragePooling2D_3", "trainable": true}, "inbound_nodes": [[["Conv2D_9", 0, 0, {}]]]}, {"name": "Conv2D_10", "class_name": "Conv2D", "config": {"filters": 513, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_10", "trainable": true}, "inbound_nodes": [[["AveragePooling2D_3", 0, 0, {}]]]}, {"name": "Conv2D_11", "class_name": "Conv2D", "config": {"filters": 513, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_11", "trainable": true}, "inbound_nodes": [[["Conv2D_10", 0, 0, {}]]]}, {"name": "Conv2D_12", "class_name": "Conv2D", "config": {"filters": 513, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "Conv2D_12", "trainable": true}, "inbound_nodes": [[["Conv2D_11", 0, 0, {}]]]}, {"name": "GlobalMaxPooling2D_0", "class_name": "GlobalMaxPooling2D", "config": {"data_format": "channels_last", "name": "GlobalMaxPooling2D_0", "trainable": true}, "inbound_nodes": [[["Conv2D_12", 0, 0, {}]]]}, {"name": "Dense_0", "class_name": "Dense", "config": {"units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "Dense_0", "trainable": true}, "inbound_nodes": [[["GlobalMaxPooling2D_0", 0, 0, {}]]]}, {"name": "Dense_1", "class_name": "Dense", "config": {"units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "Dense_1", "trainable": true}, "inbound_nodes": [[["Dense_0", 0, 0, {}]]]}, {"name": "Dense_2", "class_name": "Dense", "config": {"units": 6, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "Dense_2", "trainable": true}, "inbound_nodes": [[["Dense_1", 0, 0, {}]]]}], "input_layers": [["InputLayer_2", 0, 0]], "output_layers": [["Dense_2", 0, 0]]}, "keras_version": "tfjs-layers 1.1.0", "backend": "tensor_flow.js"}}